{"format": "layers-model", "generatedBy": null, "convertedBy": "TensorFlow.js Converter v4.22.0", "modelTopology": null, "weightsManifest": [{"paths": ["group1-shard1of79.bin", "group1-shard2of79.bin", "group1-shard3of79.bin", "group1-shard4of79.bin", "group1-shard5of79.bin", "group1-shard6of79.bin", "group1-shard7of79.bin", "group1-shard8of79.bin", "group1-shard9of79.bin", "group1-shard10of79.bin", "group1-shard11of79.bin", "group1-shard12of79.bin", "group1-shard13of79.bin", "group1-shard14of79.bin", "group1-shard15of79.bin", "group1-shard16of79.bin", "group1-shard17of79.bin", "group1-shard18of79.bin", "group1-shard19of79.bin", "group1-shard20of79.bin", "group1-shard21of79.bin", "group1-shard22of79.bin", "group1-shard23of79.bin", "group1-shard24of79.bin", "group1-shard25of79.bin", "group1-shard26of79.bin", "group1-shard27of79.bin", "group1-shard28of79.bin", "group1-shard29of79.bin", "group1-shard30of79.bin", "group1-shard31of79.bin", "group1-shard32of79.bin", "group1-shard33of79.bin", "group1-shard34of79.bin", "group1-shard35of79.bin", "group1-shard36of79.bin", "group1-shard37of79.bin", "group1-shard38of79.bin", "group1-shard39of79.bin", "group1-shard40of79.bin", "group1-shard41of79.bin", "group1-shard42of79.bin", "group1-shard43of79.bin", "group1-shard44of79.bin", "group1-shard45of79.bin", "group1-shard46of79.bin", "group1-shard47of79.bin", "group1-shard48of79.bin", "group1-shard49of79.bin", "group1-shard50of79.bin", "group1-shard51of79.bin", "group1-shard52of79.bin", "group1-shard53of79.bin", "group1-shard54of79.bin", "group1-shard55of79.bin", "group1-shard56of79.bin", "group1-shard57of79.bin", "group1-shard58of79.bin", "group1-shard59of79.bin", "group1-shard60of79.bin", "group1-shard61of79.bin", "group1-shard62of79.bin", "group1-shard63of79.bin", "group1-shard64of79.bin", "group1-shard65of79.bin", "group1-shard66of79.bin", "group1-shard67of79.bin", "group1-shard68of79.bin", "group1-shard69of79.bin", "group1-shard70of79.bin", "group1-shard71of79.bin", "group1-shard72of79.bin", "group1-shard73of79.bin", "group1-shard74of79.bin", "group1-shard75of79.bin", "group1-shard76of79.bin", "group1-shard77of79.bin", "group1-shard78of79.bin", "group1-shard79of79.bin"], "weights": [{"name": "tf_roberta_for_sequence_classification_2/roberta/encoder/layer_._0/attention/self/query/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/roberta/encoder/layer_._0/attention/self/query/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/roberta/encoder/layer_._0/attention/self/key/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/roberta/encoder/layer_._0/attention/self/key/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/roberta/encoder/layer_._0/attention/self/value/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/roberta/encoder/layer_._0/attention/self/value/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/roberta/encoder/layer_._0/attention/output/dense/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/roberta/encoder/layer_._0/attention/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/roberta/encoder/layer_._0/attention/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/roberta/encoder/layer_._0/attention/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/roberta/encoder/layer_._0/intermediate/dense/kernel", "shape": [768, 3072], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/roberta/encoder/layer_._0/intermediate/dense/bias", "shape": [3072], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/roberta/encoder/layer_._0/output/dense/kernel", "shape": [3072, 768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/roberta/encoder/layer_._0/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/roberta/encoder/layer_._0/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/roberta/encoder/layer_._0/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/roberta/encoder/layer_._1/attention/self/query/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/roberta/encoder/layer_._1/attention/self/query/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/roberta/encoder/layer_._1/attention/self/key/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/roberta/encoder/layer_._1/attention/self/key/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/roberta/encoder/layer_._1/attention/self/value/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/roberta/encoder/layer_._1/attention/self/value/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/roberta/encoder/layer_._1/attention/output/dense/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/roberta/encoder/layer_._1/attention/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/roberta/encoder/layer_._1/attention/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/roberta/encoder/layer_._1/attention/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/roberta/encoder/layer_._1/intermediate/dense/kernel", "shape": [768, 3072], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/roberta/encoder/layer_._1/intermediate/dense/bias", "shape": [3072], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/roberta/encoder/layer_._1/output/dense/kernel", "shape": [3072, 768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/roberta/encoder/layer_._1/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/roberta/encoder/layer_._1/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/roberta/encoder/layer_._1/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/roberta/encoder/layer_._2/attention/self/query/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/roberta/encoder/layer_._2/attention/self/query/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/roberta/encoder/layer_._2/attention/self/key/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/roberta/encoder/layer_._2/attention/self/key/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/roberta/encoder/layer_._2/attention/self/value/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/roberta/encoder/layer_._2/attention/self/value/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/roberta/encoder/layer_._2/attention/output/dense/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/roberta/encoder/layer_._2/attention/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/roberta/encoder/layer_._2/attention/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/roberta/encoder/layer_._2/attention/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/roberta/encoder/layer_._2/intermediate/dense/kernel", "shape": [768, 3072], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/roberta/encoder/layer_._2/intermediate/dense/bias", "shape": [3072], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/roberta/encoder/layer_._2/output/dense/kernel", "shape": [3072, 768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/roberta/encoder/layer_._2/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/roberta/encoder/layer_._2/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/roberta/encoder/layer_._2/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/roberta/encoder/layer_._3/attention/self/query/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/roberta/encoder/layer_._3/attention/self/query/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/roberta/encoder/layer_._3/attention/self/key/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/roberta/encoder/layer_._3/attention/self/key/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/roberta/encoder/layer_._3/attention/self/value/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/roberta/encoder/layer_._3/attention/self/value/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/roberta/encoder/layer_._3/attention/output/dense/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/roberta/encoder/layer_._3/attention/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/roberta/encoder/layer_._3/attention/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/roberta/encoder/layer_._3/attention/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/roberta/encoder/layer_._3/intermediate/dense/kernel", "shape": [768, 3072], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/roberta/encoder/layer_._3/intermediate/dense/bias", "shape": [3072], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/roberta/encoder/layer_._3/output/dense/kernel", "shape": [3072, 768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/roberta/encoder/layer_._3/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/roberta/encoder/layer_._3/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/roberta/encoder/layer_._3/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/roberta/encoder/layer_._4/attention/self/query/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/roberta/encoder/layer_._4/attention/self/query/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/roberta/encoder/layer_._4/attention/self/key/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/roberta/encoder/layer_._4/attention/self/key/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/roberta/encoder/layer_._4/attention/self/value/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/roberta/encoder/layer_._4/attention/self/value/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/roberta/encoder/layer_._4/attention/output/dense/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/roberta/encoder/layer_._4/attention/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/roberta/encoder/layer_._4/attention/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/roberta/encoder/layer_._4/attention/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/roberta/encoder/layer_._4/intermediate/dense/kernel", "shape": [768, 3072], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/roberta/encoder/layer_._4/intermediate/dense/bias", "shape": [3072], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/roberta/encoder/layer_._4/output/dense/kernel", "shape": [3072, 768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/roberta/encoder/layer_._4/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/roberta/encoder/layer_._4/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/roberta/encoder/layer_._4/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/roberta/encoder/layer_._5/attention/self/query/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/roberta/encoder/layer_._5/attention/self/query/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/roberta/encoder/layer_._5/attention/self/key/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/roberta/encoder/layer_._5/attention/self/key/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/roberta/encoder/layer_._5/attention/self/value/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/roberta/encoder/layer_._5/attention/self/value/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/roberta/encoder/layer_._5/attention/output/dense/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/roberta/encoder/layer_._5/attention/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/roberta/encoder/layer_._5/attention/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/roberta/encoder/layer_._5/attention/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/roberta/encoder/layer_._5/intermediate/dense/kernel", "shape": [768, 3072], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/roberta/encoder/layer_._5/intermediate/dense/bias", "shape": [3072], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/roberta/encoder/layer_._5/output/dense/kernel", "shape": [3072, 768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/roberta/encoder/layer_._5/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/roberta/encoder/layer_._5/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/roberta/encoder/layer_._5/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/roberta/embeddings/word_embeddings/weight", "shape": [50265, 768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/roberta/embeddings/token_type_embeddings/embeddings", "shape": [1, 768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/roberta/embeddings/position_embeddings/embeddings", "shape": [514, 768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/roberta/embeddings/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/roberta/embeddings/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/classifier/dense/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/classifier/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/classifier/out_proj/kernel", "shape": [768, 7], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification_2/classifier/out_proj/bias", "shape": [7], "dtype": "float32"}]}]}